notes/meeting_2022nov06.md
- [meeting notes November 6, 2022](#org1703d7c)
  - [the raku study group](#orga9a36a7)
  - [promotion](#org94bc94e)
    - [get on raku irc](#org2f572f1)
    - [email liz, suggest a mention in raku weekly news?](#org78770b7)
    - [post note to reddit/r/rakulang](#org0eb803f)
  - [topics](#orgde372ef)
    - [revisiting this issue:](#org0d17441)
    - [anonymous scalar variable (the plain $)](#orged44210)
    - [marton polgar has buggy things to talk about](#org963c50c)
    - [weekly challenge&#x2013; much activity](#org920e9ac)
  - [announcements](#orgdda19a3)
    - [lambert lum is looking for raku speakers for svperl on Jan 5, 2023](#orgd435adb)
    - [November 20th: the next raku study group meeting](#org62d920c)
    - [By the way: I've upgraded my internet to at&t fiber.  Anyone see any freezes, etc?](#orgb9b8c5b)


<a id="org1703d7c"></a>

# meeting notes November 6, 2022


<a id="orga9a36a7"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022nov06.md>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/2022nov06>
    
    3.  last meeting notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022oct23.md>


<a id="org94bc94e"></a>

## promotion


<a id="org2f572f1"></a>

### get on raku irc


<a id="org78770b7"></a>

### email liz, suggest a mention in raku weekly news?


<a id="org0eb803f"></a>

### post note to reddit/r/rakulang


<a id="orgde372ef"></a>

## topics


<a id="org0d17441"></a>

### revisiting this issue:

1.  <https://github.com/rakudo/rakudo/issues/4945>

2.  Rob likes Marton's explanation, but suggests an error message would be good


<a id="orged44210"></a>

### anonymous scalar variable (the plain $)

1.  but what if you use a Capture object?


<a id="org963c50c"></a>

### marton polgar has buggy things to talk about

1.  smarmatches against match/substitution expressions behave strangely

2.  smartmatch sometimes acts like a given, loads $\_ when you don't expect.

3.  <https://github.com/Raku/problem-solving/issues/250>

4.  <https://github.com/Raku/problem-solving/issues/346>

5.  bruce gray aside:

    1.  docker run -v c:/Users/bruce:/mnt/me &#x2013;rm -it jjmerelo/alpine-raku:2020.01    /mnt/me/bb02<sub>c6.raku</sub>


<a id="org920e9ac"></a>

### weekly challenge&#x2013; much activity

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-189/>


<a id="orgdda19a3"></a>

## announcements


<a id="orgd435adb"></a>

### lambert lum is looking for raku speakers for svperl on Jan 5, 2023


<a id="org62d920c"></a>

### November 20th: the next raku study group meeting


<a id="orgb9b8c5b"></a>

### By the way: I've upgraded my internet to at&t fiber.  Anyone see any freezes, etc?
